УТ_для_edt/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьIDГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаНачальнойЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТокенГруппы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартГруппаПользователя</name>
    <comment>//++ #Б-3538 смарт: Фролов 10.06.2025 //Иерархия учетных записей мессенджеров и социальных сетей </comment>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>смартПодразделениеПользователя</name>
    <comment>//++ #Б-3538 смарт: Фролов 10.06.2025 //Иерархия учетных записей мессенджеров и социальных сетей </comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_РаботаСМессенджерамиКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// CRM работа с мессенджерами сервер
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Подключает обработчик служебных сообщений.
//
// Параметры:
//	ИдентификаторыОбсуждений - Массив - Идентификаторы обсуждений.
//
Процедура ПодключитьОбработчикСлужебныхСообщений(ИдентификаторыОбсуждений) Экспорт
	
	Для каждого Идентификатор из ИдентификаторыОбсуждений Цикл
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСлужебногоСообщенияМессенджера",
			 CRM_РаботаСМессенджерамиКлиент);
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, Идентификатор, ОписаниеОповещения);
	КонецЦикла;
	
КонецПроцедуры

// Подключает обработчик новых сообщений.
//
// Параметры:
//	ИдентификаторыОбсуждений - Массив - Идентификаторы обсуждений.
//
Процедура ПодключитьОбработчикНовыхСообщений(ИдентификаторыОбсуждений) Экспорт
	
	Для каждого Идентификатор из ИдентификаторыОбсуждений Цикл
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикНовогоСообщенияМессенджера", CRM_РаботаСМессенджерамиКлиент);
		СистемаВзаимодействия.НачатьПодключениеОбработчикаНовыхСообщений(, Идентификатор, ОписаниеОповещения);
	КонецЦикла;
	
КонецПроцедуры

// Обработчик нового служебного сообщения мессенджера.
//
// Параметры:
//	Сообщение - ДокументСсылка.CRM_СообщениеМессенджера - Сообщение.
//	ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ОбработчикНовогоСлужебногоСообщенияМессенджера(Сообщение, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Сообщение.Данные) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сообщение.Данные) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательСистемыВзаимодействия = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
	Если ПользовательСистемыВзаимодействия = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если Сообщение.Данные = "CRM_ПолученыНовыеСообщения" Тогда
		Оповестить(Сообщение.Данные);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик нового сообщения мессенджера.
//
// Параметры:
//	Сообщение - ДокументСсылка.CRM_СообщениеМессенджера - Сообщение.
//	ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ОбработчикНовогоСообщенияМессенджера(Сообщение, ДополнительныеПараметры) Экспорт
	
	ПользовательСистемыВзаимодействия = СистемаВзаимодействия.ИдентификаторТекущегоПользователя();
	Если ПользовательСистемыВзаимодействия = "" Тогда
		Возврат;
	КонецЕсли;
	CRM_РаботаСМессенджерамиСервер.ПолучитьСообщенияУчетнойЗаписиВФоне(ПредопределенноеЗначение("Справочник.CRM_УчетныеЗаписиМессенджеров.СистемаВзаимодействия"));
	
КонецПроцедуры

// Функция возвращает признак использования условий использования файлов.
//
// Параметры:
//	ТипМессенджера - Строка - тип мессенджера.
//
// Возвращаемое значение:
//  Булево - Истина, если требуется принимать условия использования для передавчи файлов.
//
Функция ДляМессенджераЕстьУсловияИспользованияФайлов(ТипМессенджера) Экспорт
	
	СписокМессенджеров = Новый СписокЗначений;
	СписокМессенджеров.Добавить("InstagramDirect");

	Возврат СписокМессенджеров.НайтиПоЗначению(ТипМессенджера) <> Неопределено;

КонецФункции // ДляМессенджераЕстьУсловияИспользованияФайлов()

#КонецОбласти
